[
  {
    "id": 9,
    "date": "2021-12-19",
    "title": "The most profound form of affection",
    "description": "Is to be fully present with other person. </br> </br> If you love someone and you are talking to them, give them your full presence. If you can't, it'll be damaging to continue. Stop, call back later when you can dedicate a hundred percent of your attention."
  },
  {
    "id": 8,
    "date": "2021-12-19",
    "title": "The Craftman Mindset",
    "description": "As young people, half of our day fills by anxious thoughts about the future. </br> </br> We want to somehow guarantee it, and we use selling ourself as a way to do it. It's easy to fall into the trap of \"How can I convince other people that I am a superstar?\" </br> </br> The reason it's a trap is because it will never releave the anxiety, because if you are not useful, not excellent at what you do, than you are not a superstar and that anxiety will never disappear. Selling yourself is an ever thinning veil.  </br> </br> Instead, remember that you have what it takes, and it will take time. Do things that will push you to grow your skillset, your ability to lead, learn and follow."
  },
  {
    "id": 7,
    "date": "2021-12-19",
    "title": "Feeling Success, Being Successful, Having other people think you're successful",
    "description": "All of these goals are exclusive to each other. When you work on feeling successful, you're not necesarily being successful. When you work on making other people think you're successful, you're not being successful. </br> </br> And there are 24 hours in a day. Where do you want to focus most of your time on? </br> </br> To be honest, I'm not sure where the answer is."
  },
  {
    "id": 6,
    "date": "2021-10-23",
    "title": "Change is real",
    "description": "We turn keys all the time. Or rather: time turns keys all the time. Because time means change. And change is natural of life. The reason to hope. Neuroplasticity is the way out brains change their structure according to the things we experience. </br> </br> None of us are the same people we were ten years ago. When we feel or experience terrible things, it is useful to remember that nothing lasts. Perspective shifts. We become different version of ourselves.</br> </br>The hardest question I have ever asked is: 'How do I stay alive for other people if I have no one?' The answer is that you stay alive for other version of you. For the people you will <span class= \" italic\"> meet</span>, yes, sure, but also the people you will <span class=\" italic\">be.</span> "
  },
  {
    "id": 5,
    "date": "2021-10-02",
    "title": "Instead",
    "description": "A simple substitude might change a habit. </br> </br> Instead of a snack, brush your teeth.</br> </br> Instead of a nap, go for a walk. </br> </br>Instead of a nasty tweet or cutting remark, write down in a private notebook.</br> </br> Instead of the elevator, take the stairs. </br> </br>Instead of doomscrolling, send someone a nice note. </br> </br>Instead of an angry email, make a phone call.</br> </br> Instead of a purchase seeking joy, consider donation."
  },
  {
    "id": 4,
    "date": "2021-09-26",
    "title": "Become a person who Actually Does Things",
    "description": "There are two kinds of people in the world: People who actually do things, and people who don't.  </br></br> What do I actually mean by this? To achieve a goal, this breaks down into two parts: figure out what needs to be done, and actually do it. </br></br> As stated, this sounds completely trivial. But I think there is a really important and non-obvious point here. Some part of me is convinced that the main bottleneck for achieving my goals is being smart, coming up with the best plan, getting all of the necessary information. And this is true! It doesn't matter how good you are at doing things, if what you're doing is crap. But it also doesn't matter how good my plan is if I never act upon it. </br></br>And it's really easy to miss this point. It's easy to always think \"I can do this tomorrow\" or \"this is not a priority\" or \"this would never work\". And it's hard, because sometimes those thoughts are correct. But I find, unless I put in active effort, I'm the kind of person who'll always have those thoughts. I'll never actually act upon my goals, change things about my life. </br></br>One of the main symptoms of this is that I'm always aware of my problems in life, and will often aware of them for a very long. I'll notice that I don't exercise enough, that I'm not enjoying the courses I'm studying, that I really dislike being single, that I dont have enough time to do what I find most fulfilling and that I am a total wasteman. But there wont be a connection in my mind from \"this is a problem\" to  \"what am I going to do about it\". It's not that I think through the problem, and conclude that I can't do anything, it never feels like there's a question to be asked in the first place! And I think this is a problem that extends beyond me - I notice some amount of this in most of my friends, and I think it's inceredibly widespread. There seems to be a mental block between \"things are not as I want them to be\" and \"I can actually to something about it\" </br></br> I'm writing this post not to complain about how much it sucks, it's because I think this is a solvable problem. Being the kind of person who does things, an agent, is a skill, and I think it is a trainable skill. And this is hard, and won't work perfectly, but there's a lot of room for progress. And this is one of the most valuable skills I've ever tried developing. </br></br>The main symptom is that, in the movement, acting upon your desire never feels urgent. It never feels important and can be put off. Or it never feels possible, the problem just feels like a fact of life. And so the solution must center on solving the problem in the movement. And the solution that worked for me, is to make it part of your identity to be an agent. Make it a point of principle to do things, not because the thing is necessarily the perfect action, but because I choose the life where I do things, over the life where I always wait for the perfect opportunity. </br></br>Notice the small problem, and fix them. Notice when the jug of water is empty, and be the one to fill it. Notice when you say \"oh, I can do this tomorrow\" and do it today. Notice when you think \"I should get round to this sometime\" and actually do it. Notice when something is inefficient, notice the thing nobody is doing, and be the person who does it! </br></br> It doesn't matter if I'm not doing the right thing, because what I'm doing is not that important. I can close off the paralysing thoughts, not by answering them on their own terms, but by realising that the choice I make today affects the kind of person I'll be for the rest of my life. And that that's far more important than whatever trivial bullshit is going on in my life today. And thus I train the habit of actually doing things.  </br></br>And it doesn't even matter if I do make the wrong and imperfect choices in all of the day-to-day mundanity. What matters is that, when that one golden opportunity comes along, I am that kind of person who will take it. A thousand tiny losses are nothing against the big win that really counts. </br></br>If there's one thing you take from this post, let it be this: notice the next time you worry over a choice, or pass up an opportunity. And ask yourself not \"what is the right decision\" but rather \"which decision will get me closer to the kind of person I want to be\"."
  },
  {
    "id": 3,
    "date": "2021-09-20",
    "title": "On expanding scope",
    "description": "I reflected recently about the moments where I felt the happiest. The moments where I saw the largest gain, or experienced person growth. During these moments, the one constant was that I was thinking about something greater than myself — family, team, friends. </br> </br> Then I thought of the moments where I was the closest to causing irreparable damage. In these moments the constant was that I was internally focused, worried about myself, anxious."
  },
  {
    "id": 2,
    "date": "2021-09-07",
    "title": "Consumption",
    "description": "When procastinating, give yourself a hard rule -- you can only produce. No more consumption. You don't have do what you're procastinating about, but you do need to produce."
  },
  {
    "id": 1,
    "date": "2021-09-02",
    "title": "It's not about what you want",
    "description": "Many people want to be successful in business. Many people want to be excellent coders. Many people want to have a great relationship. When I look at those that are the best in their crafts, it is not their desire that sets them apart from the crowd. It is their clear understanding of what it takes, and their resolve to do what it takes. </br> </br> What to be great in business? Prepare to be doubted by many. Want to be an excellent engineer, prepare to face the limits of your knowledge, prepare to sound dumb many times over. Want to be great at relationship, prepare to face rejections."
  }
]
